namespace Pineapple_Educate;

// Горячие клавиши JetBrains Rider.
public class ExtRiderHotkeys
{
    // Поиск любого элемента во всем проекте: ctrl + N
    // Дублирование полей/свойств/методов: ctrl + D
    // Закрытие любого ненужного окошка: shift + esc
    // Переименовать объект и все места использования: F2
    
    // Перемещение между элементами класса: alt + стрелки вверх-вниз
    // Перемещение между открытыми вкладками: alt + стрелки влево-вправо
    // Умное перемещение выделенного объекта внутри класса: ctrl + alt + shift + стрелки вверх-вниз
    

    
}