namespace Alexander.FiLi;

internal class Movie(string name, string yearRelease, string genre, string director, string actors, string description)
{
    public Movie() : this
    (
        "Игра Эндера",
        "2013",
        "Фантастика, боевик, приключения, фэнтези",
        "Гевин Худ",
        """
        Эйса Баттерфилд, Харрисон Форд, Бен Кингсли, Виола Дэвис, Хейли Стайнфелд, Эбигейл Бреслин, Арамис Найт,
        Сурадж Партха, Мойзес Ариас, Кайлин Рамбо
        """,
        """
        Действие происходит в 2135 году. Человечество пережило два вторжения инопланетной расы «жукеров», лишь чудом уцелев,
        и готовится к очередному вторжению. Для поиска пилотов и военачальников, способных принести Земле победу,
        создаётся военная школа, в которую отправляют самых талантливых детей. Среди этих детей Эндрю (Эндер) Виггин,
        будущий полководец Международного флота Земли и единственная надежда человечества на спасение.
        """
    )
    {
    }

    internal string Name { get; set; } = name;

    internal string YearRelease { get; set; } = yearRelease;

    internal string Genre { get; set; } = genre;

    internal string Director { get; set; } = director;

    internal string Actors { get; set; } = actors;

    internal string Description { get; set; } = description;

    public static void Print(Movie movie)
    {
        Console.WriteLine
        (
            $"""
             +=========================================================================================================+
             1. НАЗВАНИЕ: {movie.Name}.
             +---------------------------------------------------------------------------------------------------------+
             2. ГОД: {movie.YearRelease}.
             +---------------------------------------------------------------------------------------------------------+
             3. ЖАНР: {movie.Genre}.
             +---------------------------------------------------------------------------------------------------------+
             4. РЕЖИССЕР: {movie.Director}.
             +---------------------------------------------------------------------------------------------------------+
             5. АКТЕРЫ:
             {movie.Actors}.
             +---------------------------------------------------------------------------------------------------------+
             6. ОПИСАНИЕ:
             {movie.Description}.
             +=========================================================================================================+
             """
        );
    }
}