namespace Alexander.FiLi;

internal static class TextExtension
{
    internal const string StartMessage =
        """
        +=========================================================================================================+
        ||                                          _____ ___  _    ___                                          ||
        ||                                         |  ___|_ _/| |  |_ _/                                         ||
        ||                                         | |_   | | | |   | |                                          ||
        ||                                         |  _|  | | | |__ | |                                          ||
        ||                                         |_|   |___\|____|___\                                         ||
        ||                                                                                                       ||
        ||                                 Вас приветствует FiLi (Film Library)!                                 ||
        ||                     Приложение, своего рода библиотека, которую Вы создаете сами.                     ||
        ||                                                                                                       ||
        +=========================================================================================================+
        """;

    internal const string Menu = """
                                 1. Список фильмов.
                                 2. Добавить фильм.
                                 3. Очистить консоль.
                                 4. Выход.
                                 Введите номер пункта меню: 
                                 """;

    internal const string NameDir = "fili";

    internal const string Separator =
        "+=========================================================================================================+";

    internal static string GetMovieInfo(Movie? movie)
    {
        return movie != null
            ? $"""
               {Separator}
               1. НАЗВАНИЕ: {movie.Name}.
               +---------------------------------------------------------------------------------------------------------+
               2. ГОД: {movie.Year}.
               +---------------------------------------------------------------------------------------------------------+
               3. ЖАНР: {movie.Genre}.
               +---------------------------------------------------------------------------------------------------------+
               4. РЕЖИССЕР: {movie.Director}.
               +---------------------------------------------------------------------------------------------------------+
               5. АКТЕРЫ:
               {movie.Actors}.
               +---------------------------------------------------------------------------------------------------------+
               6. ОПИСАНИЕ:
               {movie.Description}.
               {Separator}
               """
            : $"{Separator}";
    }
}